HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxEth_regdef.h
/** \\brief  Register 65 - MMC Receive Interrupt Register */
typedef struct _Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits
{
    unsigned int RXGBFRMIS:1;               /**< \brief [0:0] MMC Receive Good Bad Frame Counter Interrupt Status (r) */
    unsigned int RXGBOCTIS:1;               /**< \brief [1:1] MMC Receive Good Bad Octet Counter Interrupt Status (r) */
    unsigned int RXGOCTIS:1;                /**< \brief [2:2] MMC Receive Good Octet Counter Interrupt Status. (r) */
    unsigned int RXBCGFIS:1;                /**< \brief [3:3] MMC Receive Broadcast Good Frame Counter Interrupt Status. (r) */
    unsigned int RXMCGFIS:1;                /**< \brief [4:4] MMC Receive Multicast Good Frame Counter Interrupt Status (r) */
    unsigned int RXCRCERFIS:1;              /**< \brief [5:5] MMC Receive CRC Error Frame Counter Interrupt Status (r) */
    unsigned int RXALGNERFIS:1;             /**< \brief [6:6] MMC Receive Alignment Error Frame Counter Interrupt Status (r) */
    unsigned int RXRUNTFIS:1;               /**< \brief [7:7] MMC Receive Runt Frame Counter Interrupt Status (r) */
    unsigned int RXJABERFIS:1;              /**< \brief [8:8] MMC Receive Jabber Error Frame Counter Interrupt Status (r) */
    unsigned int RXUSIZEGFIS:1;             /**< \brief [9:9] MMC Receive Undersize Good Frame Counter Interrupt Status (r) */
    unsigned int RXOSIZEGFIS:1;             /**< \brief [10:10] MMC Receive Oversize Good Frame Counter Interrupt Status (r) */
    unsigned int RX64OCTGBFIS:1;            /**< \brief [11:11] MMC Receive 64 Octet Good Bad Frame Counter Interrupt Status (r) */
    unsigned int RX65T127OCTGBFIS:1;        /**< \brief [12:12] MMC Receive 65 to 127 Octet Good Bad Frame Counter Interrupt Status (r) */
    unsigned int RX128T255OCTGBFIS:1;       /**< \brief [13:13] MMC Receive 128 to 255 Octet Good Bad Frame Counter Interrupt Status (r) */
    unsigned int RX256T511OCTGBFIS:1;       /**< \brief [14:14] MMC Receive 256 to 511 Octet Good Bad Frame Counter Interrupt Status (r) */
    unsigned int RX512T1023OCTGBFIS:1;      /**< \brief [15:15] MMC Receive 512 to 1023 Octet Good Bad Frame Counter Interrupt Status (r) */
    unsigned int RX1024TMAXOCTGBFIS:1;      /**< \brief [16:16] MMC Receive 1024 to Maximum Octet Good Bad Frame Counter Interrupt Status (r) */
    unsigned int RXUCGFIS:1;                /**< \brief [17:17] MMC Receive Unicast Good Frame Counter Interrupt Status (r) */
    unsigned int RXLENERFIS:1;              /**< \brief [18:18] MMC Receive Length Error Frame Counter Interrupt Status (r) */
    unsigned int RXORANGEFIS:1;             /**< \brief [19:19] MMC Receive Out Of Range Error Frame Counter Interrupt Status (r) */
    unsigned int RXPAUSFIS:1;               /**< \brief [20:20] MMC Receive Pause Frame Counter Interrupt Status (r) */
    unsigned int RXFOVFIS:1;                /**< \brief [21:21] MMC Receive FIFO Overflow Frame Counter Interrupt Status (r) */
    unsigned int RXVLANGBFIS:1;             /**< \brief [22:22] MMC Receive VLAN Good Bad Frame Counter Interrupt Status (r) */
    unsigned int RXWDOGFIS:1;               /**< \brief [23:23] MMC Receive Watchdog Error Frame Counter Interrupt Status (r) */
    unsigned int RXRCVERRFIS:1;             /**< \brief [24:24] MMC Receive Error Frame Counter Interrupt Status (r) */
    unsigned int RXCTRLFIS:1;               /**< \brief [25:25] MMC Receive Control Frame Counter Interrupt Status (r) */
    unsigned int reserved_26:6;             /**< \brief \internal Reserved */
} Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits;

/** \\brief  - */
typedef struct _Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits
{
    unsigned int RXGBFRMIM:1;               /**< \brief [0:0] MMC Receive Good Bad Frame Counter Interrupt Mask (rw) */
    unsigned int RXGBOCTIM:1;               /**< \brief [1:1] MMC Receive Good Bad Octet Counter Interrupt Mask (rw) */
    unsigned int RXGOCTIM:1;                /**< \brief [2:2] MMC Receive Good Octet Counter Interrupt Mask (rw) */
    unsigned int RXBCGFIM:1;                /**< \brief [3:3] MMC Receive Broadcast Good Frame Counter Interrupt Mask (rw) */
    unsigned int RXMCGFIM:1;                /**< \brief [4:4] MMC Receive Multicast Good Frame Counter Interrupt Mask (rw) */
    unsigned int RXCRCERFIM:1;              /**< \brief [5:5] MMC Receive CRC Error Frame Counter Interrupt Mask (rw) */
    unsigned int RXALGNERFIM:1;             /**< \brief [6:6] MMC Receive Alignment Error Frame Counter Interrupt Mask (rw) */
    unsigned int RXRUNTFIM:1;               /**< \brief [7:7] MMC Receive Runt Frame Counter Interrupt Mask (rw) */
    unsigned int RXJABERFIM:1;              /**< \brief [8:8] MMC Receive Jabber Error Frame Counter Interrupt Mask (rw) */
    unsigned int RXUSIZEGFIM:1;             /**< \brief [9:9] MMC Receive Undersize Good Frame Counter Interrupt Mask (rw) */
    unsigned int RXOSIZEGFIM:1;             /**< \brief [10:10] MMC Receive Oversize Good Frame Counter Interrupt Mask (rw) */
    unsigned int RX64OCTGBFIM:1;            /**< \brief [11:11] MMC Receive 64 Octet Good Bad Frame Counter Interrupt Mask (rw) */
    unsigned int RX65T127OCTGBFIM:1;        /**< \brief [12:12] MMC Receive 65 to 127 Octet Good Bad Frame Counter Interrupt Mask (rw) */
    unsigned int RX128T255OCTGBFIM:1;       /**< \brief [13:13] MMC Receive 128 to 255 Octet Good Bad Frame Counter Interrupt Mask (rw) */
    unsigned int RX256T511OCTGBFIM:1;       /**< \brief [14:14] MMC Receive 256 to 511 Octet Good Bad Frame Counter Interrupt Mask (rw) */
    unsigned int RX512T1023OCTGBFIM:1;      /**< \brief [15:15] MMC Receive 512 to 1023 Octet Good Bad Frame Counter Interrupt Mask (rw) */
    unsigned int RX1024TMAXOCTGBFIM:1;      /**< \brief [16:16] MMC Receive 1024 to Maximum Octet Good Bad Frame Counter Interrupt Mask (rw) */
    unsigned int RXUCGFIM:1;                /**< \brief [17:17] MMC Receive Unicast Good Frame Counter Interrupt Mask (rw) */
    unsigned int RXLENERFIM:1;              /**< \brief [18:18] MMC Receive Length Error Frame Counter Interrupt Mask (rw) */
    unsigned int RXORANGEFIM:1;             /**< \brief [19:19] MMC Receive Out Of Range Error Frame Counter Interrupt Mask (rw) */
    unsigned int RXPAUSFIM:1;               /**< \brief [20:20] MMC Receive Pause Frame Counter Interrupt Mask (rw) */
    unsigned int RXFOVFIM:1;                /**< \brief [21:21] MMC Receive FIFO Overflow Frame Counter Interrupt Mask (rw) */
    unsigned int RXVLANGBFIM:1;             /**< \brief [22:22] MMC Receive VLAN Good Bad Frame Counter Interrupt Mask (rw) */
    unsigned int RXWDOGFIM:1;               /**< \brief [23:23] MMC Receive Watchdog Error Frame Counter Interrupt Mask (rw) */
    unsigned int RXRCVERRFIM:1;             /**< \brief [24:24] MMC Receive Error Frame Counter Interrupt Mask (rw) */
    unsigned int RXCTRLFIM:1;               /**< \brief [25:25] MMC Receive Control Frame Counter Interrupt Mask (rw) */
    unsigned int reserved_26:6;             /**< \brief \internal Reserved */
} Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits;

